zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCan_reg.h
/**
 * \file IfxCan_reg.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC39XB_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Can_Registers_Cfg Can address
 * \ingroup IfxSfr_Can_Registers
 * 
 * \defgroup IfxSfr_Can_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Can_Registers_Cfg
 *
 * \defgroup IfxSfr_Can_Registers_Cfg_Can0 2-CAN0
 * \ingroup IfxSfr_Can_Registers_Cfg
 *
 * \defgroup IfxSfr_Can_Registers_Cfg_Can1 2-CAN1
 * \ingroup IfxSfr_Can_Registers_Cfg
 *
 * \defgroup IfxSfr_Can_Registers_Cfg_Can2 2-CAN2
 * \ingroup IfxSfr_Can_Registers_Cfg
 *
 *
 */
#ifndef IFXCAN_REG_H
#define IFXCAN_REG_H 1
/******************************************************************************/
#include "IfxCan_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Can_Registers_Cfg_BaseAddress
 * \{  */

/** \brief CAN object */
#define MODULE_CAN0 /*lint --e(923, 9078)*/ ((*(Ifx_CAN*)0xF0200000u))
#define MODULE_CAN1 /*lint --e(923, 9078)*/ ((*(Ifx_CAN*)0xF0210000u))
#define MODULE_CAN2 /*lint --e(923, 9078)*/ ((*(Ifx_CAN*)0xF0220000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Can_Registers_Cfg_Can0
 * \{  */
/** \brief 0, Embedded SRAM for messages */
#define CAN0_RAM ((void*)0xF0200000u)
#define CAN0_RAM_SIZE (0x8000u)
/** \brief 0, CAN Clock Control Register */
#define CAN0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_CLC*)0xF0208000u)

/** \brief 8, Module Identification Register */
#define CAN0_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_ID*)0xF0208008u)

/** \brief 30, Module Control Register */
#define CAN0_MCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_MCR*)0xF0208030u)

/** \brief 34, Buffer receive address and transmit address */
#define CAN0_BUFADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_BUFADR*)0xF0208034u)

/** \brief 40, Measure Control Register */
#define CAN0_MECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_MECR*)0xF0208040u)

/** \brief 44, Measure Status Register */
#define CAN0_MESTAT /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_MESTAT*)0xF0208044u)

/** \brief DC, Access Enable Register Control 0 */
#define CAN0_ACCENCTR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_ACCENCTR0*)0xF02080DCu)

/** \brief E8, OCDS Control and Status */
#define CAN0_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_OCS*)0xF02080E8u)

/** \brief EC, Kernel Reset Status Clear Register */
#define CAN0_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_KRSTCLR*)0xF02080ECu)

/** \brief F0, Kernel Reset Register 1 */
#define CAN0_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_KRST1*)0xF02080F0u)

/** \brief F4, Kernel Reset Register 0 */
#define CAN0_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_KRST0*)0xF02080F4u)

/** \brief FC, Access Enable Register 0 */
#define CAN0_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_ACCEN0*)0xF02080FCu)

/** \brief 100, Access Enable Register CAN Node 0 0 */
#define CAN0_N0_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0208100u)
/** Alias (User Manual Name) for CAN0_N0_ACCENNODE0.
* To use register names with standard convension, please use CAN0_N0_ACCENNODE0.
*/
#define CAN0_ACCENNODE00 (CAN0_N0_ACCENNODE0)

/** \brief 108, Start Address Node 0 */
#define CAN0_N0_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208108u)
/** Alias (User Manual Name) for CAN0_N0_STARTADR.
* To use register names with standard convension, please use CAN0_N0_STARTADR.
*/
#define CAN0_STARTADR0 (CAN0_N0_STARTADR)

/** \brief 10C, End Address Node 0 */
#define CAN0_N0_ENDADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF020810Cu)
/** Alias (User Manual Name) for CAN0_N0_ENDADR.
* To use register names with standard convension, please use CAN0_N0_ENDADR.
*/
#define CAN0_ENDADR0 (CAN0_N0_ENDADR)

/** \brief 110, Interrupt Signalling Register 0 */
#define CAN0_N0_ISREG /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0208110u)
/** Alias (User Manual Name) for CAN0_N0_ISREG.
* To use register names with standard convension, please use CAN0_N0_ISREG.
*/
#define CAN0_ISREG0 (CAN0_N0_ISREG)

/** \brief 114, Interrupt routing for Groups 1 0 */
#define CAN0_N0_GRINT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT1*)0xF0208114u)
/** Alias (User Manual Name) for CAN0_N0_GRINT1.
* To use register names with standard convension, please use CAN0_N0_GRINT1.
*/
#define CAN0_GRINT10 (CAN0_N0_GRINT1)

