zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxCan_reg.h
/** \brief 2F4, Tx Event FIFO Status 0 */
#define CAN2_N0_TX_EFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF02282F4u)
/** Alias (User Manual Name) for CAN2_N0_TX_EFS.
* To use register names with standard convension, please use CAN2_N0_TX_EFS.
*/
#define CAN2_TXEFS0 (CAN2_N0_TX_EFS)

/** \brief 2F8, Tx Event FIFO Acknowledge 0 */
#define CAN2_N0_TX_EFA /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF02282F8u)
/** Alias (User Manual Name) for CAN2_N0_TX_EFA.
* To use register names with standard convension, please use CAN2_N0_TX_EFA.
*/
#define CAN2_TXEFA0 (CAN2_N0_TX_EFA)

/** \brief 500, Access Enable Register CAN Node 1 0 */
#define CAN2_N1_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0228500u)
/** Alias (User Manual Name) for CAN2_N1_ACCENNODE0.
* To use register names with standard convension, please use CAN2_N1_ACCENNODE0.
*/
#define CAN2_ACCENNODE10 (CAN2_N1_ACCENNODE0)

/** \brief 508, Start Address Node 1 */
#define CAN2_N1_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0228508u)
/** Alias (User Manual Name) for CAN2_N1_STARTADR.
* To use register names with standard convension, please use CAN2_N1_STARTADR.
*/
#define CAN2_STARTADR1 (CAN2_N1_STARTADR)

/** \brief 50C, End Address Node 1 */
#define CAN2_N1_ENDADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDADR*)0xF022850Cu)
/** Alias (User Manual Name) for CAN2_N1_ENDADR.
* To use register names with standard convension, please use CAN2_N1_ENDADR.
*/
#define CAN2_ENDADR1 (CAN2_N1_ENDADR)

/** \brief 510, Interrupt Signalling Register 1 */
#define CAN2_N1_ISREG /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ISREG*)0xF0228510u)
/** Alias (User Manual Name) for CAN2_N1_ISREG.
* To use register names with standard convension, please use CAN2_N1_ISREG.
*/
#define CAN2_ISREG1 (CAN2_N1_ISREG)

/** \brief 514, Interrupt routing for Groups 1 1 */
#define CAN2_N1_GRINT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT1*)0xF0228514u)
/** Alias (User Manual Name) for CAN2_N1_GRINT1.
* To use register names with standard convension, please use CAN2_N1_GRINT1.
*/
#define CAN2_GRINT11 (CAN2_N1_GRINT1)

/** \brief 518, Interrupt routing for Groups 2 1 */
#define CAN2_N1_GRINT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GRINT2*)0xF0228518u)
/** Alias (User Manual Name) for CAN2_N1_GRINT2.
* To use register names with standard convension, please use CAN2_N1_GRINT2.
*/
#define CAN2_GRINT21 (CAN2_N1_GRINT2)

/** \brief 520, Node 1 Timer Clock Control Register */
#define CAN2_N1_NT_CCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CCR*)0xF0228520u)
/** Alias (User Manual Name) for CAN2_N1_NT_CCR.
* To use register names with standard convension, please use CAN2_N1_NT_CCR.
*/
#define CAN2_NTCCR1 (CAN2_N1_NT_CCR)

/** \brief 524, Node 1 Timer A Transmit Trigger Register */
#define CAN2_N1_NT_ATTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_ATTR*)0xF0228524u)
/** Alias (User Manual Name) for CAN2_N1_NT_ATTR.
* To use register names with standard convension, please use CAN2_N1_NT_ATTR.
*/
#define CAN2_NTATTR1 (CAN2_N1_NT_ATTR)

/** \brief 528, Node 1 Timer B Transmit Trigger Register */
#define CAN2_N1_NT_BTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0228528u)
/** Alias (User Manual Name) for CAN2_N1_NT_BTTR.
* To use register names with standard convension, please use CAN2_N1_NT_BTTR.
*/
#define CAN2_NTBTTR1 (CAN2_N1_NT_BTTR)

/** \brief 52C, Node 1 Timer C Transmit Trigger Register */
#define CAN2_N1_NT_CTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF022852Cu)
/** Alias (User Manual Name) for CAN2_N1_NT_CTTR.
* To use register names with standard convension, please use CAN2_N1_NT_CTTR.
*/
#define CAN2_NTCTTR1 (CAN2_N1_NT_CTTR)

/** \brief 530, Node 1 Timer Receive Timeout Register */
#define CAN2_N1_NT_RTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0228530u)
/** Alias (User Manual Name) for CAN2_N1_NT_RTR.
* To use register names with standard convension, please use CAN2_N1_NT_RTR.
*/
#define CAN2_NTRTR1 (CAN2_N1_NT_RTR)

/** \brief 540, Node 1 Port Control Register */
#define CAN2_N1_NPCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0228540u)
/** Alias (User Manual Name) for CAN2_N1_NPCR.
* To use register names with standard convension, please use CAN2_N1_NPCR.
*/
#define CAN2_NPCR1 (CAN2_N1_NPCR)

/** \brief 600, Core Release Register 1 */
#define CAN2_N1_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0228600u)
/** Alias (User Manual Name) for CAN2_N1_CREL.
* To use register names with standard convension, please use CAN2_N1_CREL.
*/
#define CAN2_CREL1 (CAN2_N1_CREL)

/** \brief 604, Endian Register 1 */
#define CAN2_N1_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0228604u)
/** Alias (User Manual Name) for CAN2_N1_ENDN.
* To use register names with standard convension, please use CAN2_N1_ENDN.
*/
#define CAN2_ENDN1 (CAN2_N1_ENDN)

/** \brief 60C, Data Bit Timing & Prescaler Register 1 */
#define CAN2_N1_DBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF022860Cu)
/** Alias (User Manual Name) for CAN2_N1_DBTP.
* To use register names with standard convension, please use CAN2_N1_DBTP.
*/
#define CAN2_DBTP1 (CAN2_N1_DBTP)

/** \brief 610, Test Register 1 */
#define CAN2_N1_TEST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0228610u)
/** Alias (User Manual Name) for CAN2_N1_TEST.
* To use register names with standard convension, please use CAN2_N1_TEST.
*/
#define CAN2_TEST1 (CAN2_N1_TEST)

/** \brief 614, RAM Watchdog 1 */
#define CAN2_N1_RWD /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0228614u)
/** Alias (User Manual Name) for CAN2_N1_RWD.
* To use register names with standard convension, please use CAN2_N1_RWD.
*/
#define CAN2_RWD1 (CAN2_N1_RWD)

/** \brief 618, CC Control Register 1 */
#define CAN2_N1_CCCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0228618u)
/** Alias (User Manual Name) for CAN2_N1_CCCR.
* To use register names with standard convension, please use CAN2_N1_CCCR.
*/
#define CAN2_CCCR1 (CAN2_N1_CCCR)

/** \brief 61C, Nominal Bit Timing & Prescaler Register 1 */
#define CAN2_N1_NBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF022861Cu)
/** Alias (User Manual Name) for CAN2_N1_NBTP.
* To use register names with standard convension, please use CAN2_N1_NBTP.
*/
#define CAN2_NBTP1 (CAN2_N1_NBTP)

